KefanZhg/nrf52-trails/modules/eeprom/at24c256/main.c
/**
 * Copyright (c) 2016 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 * @defgroup tw_scanner main.c
 * @{
 * @ingroup nrf_twi_example
 * @brief TWI Sensor Example main file.
 *
 * This file contains the source code for a sample application using TWI.
 *
 */

#include <stdio.h>
#include "boards.h"
#include "app_util_platform.h"
#include "app_error.h"
#include "nrf_drv_twi.h"



#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "eeprom.h"

/* TWI instance ID. */
#if TWI0_ENABLED
#define TWI_INSTANCE_ID     0
#elif TWI1_ENABLED
#define TWI_INSTANCE_ID     1
#endif

 /* Number of possible TWI addresses. */
//  #define TWI_ADDRESSES      127

/* TWI instance. */
const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);


/**
 * @brief TWI initialization.
 */
// void twi_init (void)
// {
//     ret_code_t err_code;

//     const nrf_drv_twi_config_t twi_config = {
//        .scl                = ARDUINO_SCL_PIN,
//        .sda                = ARDUINO_SDA_PIN,
//        .frequency          = NRF_DRV_TWI_FREQ_100K,
//        .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
//        .clear_bus_init     = false
//     };

//     err_code = nrf_drv_twi_init(&m_twi, &twi_config, NULL, NULL);
//     APP_ERROR_CHECK(err_code);

//     nrf_drv_twi_enable(&m_twi);
// }


/**
 * @brief Function for main application entry.
 */
int main(void)
{
    // ret_code_t err_code;
    // uint8_t address;
    // uint8_t sample_data;
    // bool detected_device = false;

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));
    NRF_LOG_DEFAULT_BACKENDS_INIT();

    NRF_LOG_INFO("EEPROM started.");
    NRF_LOG_FLUSH();
    // twi_init();
    eeprom_init();
    NRF_LOG_INFO("EEPROM Initialized.");
    NRF_LOG_FLUSH();

    // for (address = 1; address <= TWI_ADDRESSES; address++)
    // {
    //     err_code = nrf_drv_twi_rx(&m_twi, address, &sample_data, sizeof(sample_data));
    //     if (err_code == NRF_SUCCESS)
    //     {
    //         detected_device = true;
    //         NRF_LOG_INFO("TWI device detected at address 0x%x.", address);
    //     }
    //     NRF_LOG_FLUSH();
    // }

    // if (!detected_device)
    // {
    //     NRF_LOG_INFO("No device was found.");
    //     NRF_LOG_FLUSH();
    // }

    uint8_t data[4] = {0x01, 0x02, 0x03, 0x04};
    eeprom_write(0x100, data, 4);

    NRF_LOG_INFO("Data write from EEPROM: %x %x %x %x", data[0], data[1], data[2], data[3]);
    NRF_LOG_FLUSH();

    uint8_t read_data[4];
    eeprom_read(0x101, read_data, 4);

    NRF_LOG_INFO("Data read from EEPROM : %x %x %x %x", read_data[0], read_data[1], read_data[2], read_data[3]);
    NRF_LOG_FLUSH();

    while (true)
    {
        /* Empty loop. */
    }
}

/** @} */
